{"inkVersion":20,"root":[["^The forest around you unfolds to a path through the trees as you venture deeper into the enchanting realm.","\n","^In the deeper forest the air feels pleasantly colder as the thick canopy of trees doesn’t filter as much light and warmth through to the ground.","\n","^The narrow path weaves through the towering trees, creating an inviting and adventurous route to explore.","\n","^As you slowly navigate the subtle twists and turns of the forest path, you come  across a lone flowerkin, reminiscent of a rose standing confidently by the side of the road. ",{"#":"sprite neutral"},"\n","^The flowerkin exudes the air of confidence, as her looks give a subtle warning of her tough demeanor. ",{"#":"speaker ???"},{"#":"sprite angy"},"\n","^\"And who might you be, adventuring here so deep in the woods?\" ",{"#":"speaker _"},"\n","^The tough-looking flowerkin locks eyes with you in quite intense stare, with a smirk playing on her lips. ",{"#":"speaker You"},"\n",["ev",{"^->":"0.19.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-0","flg":2},{"s":["^\"Just taking a stroll through this beautiful forest. I couldn’t resist its allure.\" ",{"->":"$r","var":true},null]}],["ev",{"^->":"0.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-1","flg":2},{"s":["^“I thought this was the right way home, but now I might be lost again. Would you be able to help?” ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"0.19.s"},[{"#n":"$r2"}],{"#":"sprite neutral"},{"#":"speaker Rosa"},{"#":"like"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["ev",{"^->":"0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"0.20.s"},[{"#n":"$r2"}],{"#":"sprite neutral"},{"#":"speaker Rosa"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^“But of course, darling! I’m Rosa, by the way, the one and only.” ",{"#":"speaker _"},"\n","^The contrast of beauty with thorny exterior embodies the enchantment and danger of the forest itself.","\n","^With the bold charisma and assertiveness, touched with the delicate beauty she’s echoing promises of thrilling adventures. ",{"#":"speaker You"},"\n",["ev",{"^->":"0.g-0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"I appreciate the confidence. What makes this forest special for you?\" ",{"->":"$r","var":true},null]}],["ev",{"^->":"0.g-0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^“Uh, okay. Nice to meet you. What’s your story, Rosa?” ",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],{"#":"like"},{"#":"speaker Rosa"},"\n",{"->":"0.g-1"},{"#f":5}],"c-3":["ev",{"^->":"0.g-0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],{"#":"dislike"},{"#":"speaker Rosa"},"\n",{"->":"0.g-1"},{"#f":5}],"#f":5}],"g-1":["^“This forest is my kingdom! I thrive in its wild embrace, and I’m not settling for anything less than extraordinary. What about you, adventurer?”","\n","^The sun briefly filters through the dense leaves, creating a dance of shadows on the moss surrounding the forest path.","\n","^The silence is more predominant deeper in the forest and is equally calming as it is mysterious.","\n",["ev",{"^->":"0.g-1.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":2},{"s":["^\"I’m just exploring, trying to enjoy the beauty of this forest.\" ",{"->":"$r","var":true},null]}],"ev","str","^_“Lost my way and I actually need some directions. Are you the queen of this forest?”","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["ev",{"^->":"0.g-1.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],{"#":"speaker Rosa"},"\n","^“Exploring, huh? You might find this place more captivating than you bargained for.”","\n",{"->":"0.g-2"},{"#f":5}],"c-5":["\n","^“Queen? More like the untamed spirit that keeps this place alive. I’ve been through storms, thunder, the dramatics. And I stood my ground!”","\n","^<i>You are about to enter a mini-game. If you do well, you can score some extra points with this character! Control your bee with WASD. ",{"#":"minigame"},"\n",{"->":"0.g-2"},{"#f":5}],"#f":5}],"g-2":["^The forest path transforms into a stage for the captivating encounter with the fearless Rosa, who has tangled with the wildest creatures and come out on top.","\n","^The boldness mixed with ethereal beauty is compelling you to stay, but after a while you decide to move on with your journey.","\n",["done",{"#f":5,"#n":"g-3"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}