{"inkVersion":20,"root":[["^As you get closer to the sun-kissed beach stretching before you, the golden sand blends seamlessly with the surrounding greenery. ",{"#":"minigame"},"\n","^The rhythmic sound of waves calmly crashing against the shore provides a smoothing background, while a gentle breeze carries the sweet aroma of the blooming flowers.","\n","^The whole beach looks warm and cozy for both pollinators and flowerkin alike, to enjoy the sun and sea breeze.","\n","^Nestled under the shade of a large tree, you notice a picnic table and a blanket filled with the most delicious-looking treats.","\n","^As you get closer to the picnic you notice a lonely flowerkin there turning to look at you and give you a casual nod. Their eyes, a mix of ocean blues with purple, seem to reflect the calmness of the waves.","\n","^Hello, coming to enjoy the beach? ",{"#":"sprite neutral"},{"#":"speaker ?"},{"#":"playmusic"},{"#":"background beach_blur"},"\n","ev","str","^Yeah, definitely. I could use some relaxation.","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^I’m actually just exploring, this place caught my eye.","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^Cool. I’m Calanthe. Or, you know, you can call me Cal if you prefer. ",{"#":"speaker Cal"},"\n","^They gesture toward the place next to them on the picnic blanket. ",{"#":"speaker _"},"\n","ev","str","^Nice to meet you, Calanthe. This is a beautiful spot to have a picnic.","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Cal it is then. Mind if I join you?","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["\n",{"->":"0.g-1"},{"#f":5}],"c-3":["\n",{"->":"0.g-1"},{"#f":5}],"#f":5}],"g-1":["^No worries, take a seat. ",{"#":"speaker Cal"},"\n","^So, what brings you here today?","\n","ev","str","^I just heard about this magical beach and thought I’d check it out.","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^I actually got lost and needed a place to rest for a while.","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["\n","^Magical beach, huh?","\n","^Yeah, I guess this place is something else.","\n",{"->":"0.g-2"},{"#f":5}],"c-5":["\n","^Tell me about it.","\n","^Sometimes you just have to take a moment for yourself to clear your thoughts.","\n",{"->":"0.g-2"},{"#f":5}],"#f":5}],"g-2":["^As you settle into a casual conversation with the calming waves in the background, the easygoing nature of Cal perfectly reflects the laid-back feeling of the beach. ",{"#":"speaker _"},"\n","^After a short but relaxing moment, you decide to move on with your journey. ",{"#":"background beach"},{"#":"sprite invisible"},"\n",["done",{"#f":5,"#n":"g-3"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}