{"inkVersion":20,"root":[["^As you approach the small cafe beneath large spruce trees, a pleasant aroma of freshly ground coffee beans and a sweet herbal scent surrounds the air.","\n","^The cafe entrance is marked by a natural arch woven with fragrant blossoms and a painted sign: “Café Flora”.","\n","^The tables are made of polished tree stumps, adorned with delicate, hand-painted wildflowers. Toadstools and mushrooms of various sizes serve as chairs, providing cozy seating for pollinators and flower people alike.","\n","^As you reach the counter, you’re greeted with a busy bee, hurrying with orders.","\n","^“What can I get you?” ",{"#":"speaker The_bee-rista"},"\n","ev","str","^A warm cup of coffee with a subtle sweet scent","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Steaming herbal tea with a bright orange hue","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^A crystal glass jug of minty lemon ice tea","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"0.g-0"},{"#f":5}],"c-2":["\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^Before you can even glance around for a free table, the barista bee hands you your drink. ",{"#":"speaker _"},"\n","^Careful not to spill, you find the nearest seat and place the drink on the log table.","\n","^You suddenly notice the table wasn’t vacant after all: a pair of worrisome eyes glances at you. ",{"#":"sprite neutral"},{"#":"playmusic"},"\n","ev","str","^I’m so sorry, I didn’t notice you! Should I move?","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^I’ll sit here, if you don’t mind!","/str","/ev",{"*":".^.c-4","flg":4},{"c-3":["\n",{"->":"0.g-1"},{"#f":5}],"c-4":["\n",{"->":"0.g-1"},{"#f":5}],"#f":5}],"g-1":["^It’s quite alright, don’t mind me… ",{"#":"speaker ?"},"\n","^The shy flowerkin, reminiscent of a lily of the valley flower, keeps sneaking looks at you.","\n","^You feel a need to say something to break the awkward silence...","\n","ev","str","^I’ve never been to this place before. I’ve heard it’s always quite busy.","/str","/ev",{"*":".^.c-5","flg":4},"ev","str","^Nice to meet you, what’s your name? Are you from around here?","/str","/ev",{"*":".^.c-6","flg":4},{"c-5":["\n","^I suppose it is.","\n","^They smile faintly as they look around. ",{"#":"speaker _"},"\n",{"->":"0.g-2"},{"#f":5}],"c-6":["\n","^Hi, there, I’m... Connie. Well, Convallaria, but you can call me Connie. ",{"#":"speaker Connie"},"\n",{"->":"0.g-2"},{"#f":5}],"#f":5}],"g-2":["done",{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}