{"inkVersion":20,"root":[["^As you approach the small cafe beneath large spruce trees, a pleasant aroma of freshly ground coffee beans and a sweet herbal scent surrounds the air.","\n","^The cafe entrance is marked by a natural arch woven with fragrant blossoms and a painted sign: “Café Flora”.","\n","^The tables are made of polished tree stumps, adorned with delicate, hand-painted wildflowers. Toadstools and mushrooms of various sizes serve as chairs, providing cozy seating for pollinators and flower people alike.","\n","^As you reach the counter, you’re greeted with a busy bee, hurrying with orders. ",{"#":"speaker The_Bee-rista"},"\n","^“What can I get you?” ",{"#":"speaker _"},"\n","ev","str","^A warm cup of coffee with a subtle sweet scent","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Steaming herbal tea with a bright orange hue","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^A crystal glass jug of minty lemon ice tea","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"0.g-0"},{"#f":5}],"c-2":["\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^Before you can even glance around for a free table, the barista bee hands you your drink. Careful not to spill, you find the nearest seat and place the drink on the log table. ",{"#":"sprite neutral"},{"#":"background cafe_blur"},"\n","^You suddenly notice the table wasn’t vacant after all: a pair of worrisome eyes glances at you. ",{"#":"speaker ???"},"\n","ev","str","^“I’m so sorry, I didn’t notice you! Should I move?”","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^“I’ll sit here, if you don’t mind!”","/str","/ev",{"*":".^.c-4","flg":4},{"c-3":["\n",{"->":"0.g-1"},{"#f":5}],"c-4":["\n",{"->":"0.g-1"},{"#f":5}],"#f":5}],"g-1":["^“It’s quite alright, don’t mind me…” ",{"#":"speaker _"},"\n","^The shy flowerkin, reminiscent of the flower of a lily of the valley, keeps sneaking looks at you.","\n","^You feel a need to say something to break the awkward silence... ",{"#":"speaker Connie"},{"#":"sprite happy"},"\n","ev","str","^“So, who are you and what brings such a pretty flowerkin such as yourself here?”","/str","/ev",{"*":".^.c-5","flg":4},"ev","str","^“Nice to meet you, what’s your name?”","/str","/ev",{"*":".^.c-6","flg":4},{"c-5":["\n","^“I’m Convallaria- I mean, y-you can call me Connie. I, uh, I was just enjoying the warm day here in the shade...” ",{"#":"sprite neutral"},{"#":"speaker _"},"\n",{"->":"0.g-2"},{"#f":5}],"c-6":["\n","^Hi, there, I’m... Connie Well, Convallaria, but you can call me Connie. ",{"#":"sprite neutral"},{"#":"speaker _"},{"#":"like"},"\n",{"->":"0.g-2"},{"#f":5}],"#f":5}],"g-2":["^You take another sip of your drink while wondering what the shimmering liquid in the tiny round glass in front of Connie was.","\n","^Connie catches you looking at the drink and lifts it up, swishing it around shyly. ",{"#":"speaker Connie"},"\n","^“Oh, it’s just some fresh morning dew... I don’t know if you’d like it...” ",{"#":"sprite happy"},"\n","^“By the way, you looked a bit lost when you came here... I suppose you’re not here just for a morning beverage? I-I mean it not in a bad way, but you seemed - lost.” ",{"#":"sprite neutral"},{"#":"speaker _"},"\n","^Connie looks shy as they raised concerns about your disoriented manner. ",{"#":"speaker Connie"},"\n","ev","str","^“I was actually hoping you’d be able to guide me towards the seaside hive. I’m quite lost, and I’d like to make it back home before tonight.”","/str","/ev",{"*":".^.c-7","flg":4},{"c-7":["\n",{"->":"0.g-3"},{"#f":5}],"#f":5}],"g-3":["^“Oh, well, I don’t usually leave the deep forest...“ ",{"#":"speaker _"},"\n","^Connie looks flustered and shifts in their seat as if they were actually ready to leave anyways.","\n","ev","str","^_Look at Connie with pleading puppy eyes","/str","/ev",{"*":".^.c-8","flg":4},"ev","str","^“I’d like it if you could show me the way. You look like you’d be a good guide.”","/str","/ev",{"*":".^.c-9","flg":4},{"c-8":["\n","^You look at Connie with pleading puppy eyes. Suddenly, you feel your heart jump... ",{"#":"like"},"\n","^<i>You are about to enter a mini-game. If you do well, you can score some extra points with this character! Control your bee with WASD. ",{"#":"minigame"},"\n",{"->":"0.g-4"},{"#f":5}],"c-9":["\n",{"->":"0.g-4"},{"#f":5}],"#f":5}],"g-4":["^Connie smiles and quickly catches a glimpse of your face again, before slowly getting up and gesturing towards your drink. ",{"#":"speaker Connie"},"\n","^“We can leave after you’re finished.” ",{"#":"speaker _"},"\n","ev","str","^Leave the half full drink on the table, surely no one would mind…","/str","/ev",{"*":".^.c-10","flg":4},"ev","str","^Chug the drink","/str","/ev",{"*":".^.c-11","flg":4},{"c-10":["\n","^You leave the drink on the table. As you are leaving, you notice the beerista take the drink... ",{"#":"background after_cafe_blur"},"\n",{"->":"0.g-5"},{"#f":5}],"c-11":["\n","^You chug the drink and wince at the sudden blast of flavor. You’re ready to go. ",{"#":"like"},{"#":"background after_cafe_blur"},"\n",{"->":"0.g-5"},{"#f":5}],"#f":5}],"g-5":["^Connie walks ahead of you without saying a word, yet keeps checking back on you to make sure you haven’t gotten lost.","\n","^You soon find yourselves at a crossroads with a tall sign with many arrows. ",{"#":"speaker Connie"},"\n","^“Here we are... I’m not sure which way would be the fastest towards the ocean though. I hope you make it back home.” ",{"#":"speaker _"},{"#":"sprite invisible"},{"#":"background after_cafe"},"\n","^You thank Connie and they soon leave after lingering a while.","\n","^<i>Was that a shy smile on their face again?","\n",["done",{"#f":5,"#n":"g-6"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}