{"inkVersion":20,"root":[["^As you step into the enchanting clearing with the sparkling pond, right at the heart of the forest, the air becomes thick with the sweet scent of the blooming flowers.","\n","^The soft sunlight filters through the green canopy, creating a mesmerizing and beautiful play of shadows and light on the forest floor and glittery pond.","\n","^Pastel cushions are scattered under the trees, creating a serene atmosphere for the flowerkin to relax and take time for themselves around the pond.","\n","^As you gaze around for a vacant spot, a confident and alluring figure catches your eye.","\n","^A flowerkin with the petals of the color of the sunset, reminiscent of a peony, sits gracefully on the pastel cushions nearest to the pond.","\n","^As you approach she looks up and a playful smile dances on her lips.","\n","^Hello there, I don’t think I’ve seen you here before. ",{"#":"speaker ?"},{"#":"sprite neutral"},{"#":"playmusic"},"\n","^Her voice is as melodious as the summer breeze, emphasizing her alluring charisma. ",{"#":"speaker _"},"\n","^What brings you here? ",{"#":"speaker ?"},"\n","ev","str","^I couldn’t resist exploring this magical place, it’s truly enchanting. Do you come here often?","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^I was looking for someone to help me. You seem familiar with this place, am I right?","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^Guilty as charged. I do have a weakness for beautiful scenery but also for intriguing company. I’m Pion by the way, pleasure to make your acquaintance. ",{"#":"speaker Pion"},"\n","^She chuckles softly, her eyes gleaming with playful mischief when she suggests you to come sit beside her on the pastel cushions. ",{"#":"speaker _"},"\n","ev","str","^This pond is really magical, is this your favorite place here?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^I feel lucky to have stumbled upon such a breathtaking view. You’re lucky to live here.","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["\n","^Oh, darling, this is my secret heaven. A place to escape the hustle and bustle of the forest. You’re welcome to share it with me, if you need it. ",{"#":"speaker Pion"},"\n",{"->":"0.g-1"},{"#f":5}],"c-3":["\n","^I’ve always had a knack for finding hidden gems and I’d be delighted to share them with someone as charming as you. ",{"#":"speaker Pion"},"\n",{"->":"0.g-1"},{"#f":5}],"#f":5}],"g-1":["^After a short but alluring conversation with the confident and flirty flowerkin, who makes the magical forest even more enchanting, you decide to move on with your journey.","\n",["done",{"#f":5,"#n":"g-2"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}