{"inkVersion":20,"root":[["^The air in the almost-magical forest library is filled with the sweet scent of blooming flowers. Large wooden bookshelves tower overhead, their shelves adorned with ancient tomes and delicate scrolls. ",{"#":"sprite neutral"},"\n","^Amidst the enchanting ambiance, you notice a quiet, almost inaudible flower person carefully browsing through a large hardcover book. ",{"#":"speaker You"},"\n","^“Hi there, I’m in need of some directions. Would you happen to know how I can get to the ocean?” ",{"#":"sprite invisible"},{"#":"speaker _"},"\n","^The flowerkin, almost shocked with your approach, shuts the book with a loud slam, startling themselves in the process. ",{"#":"speaker ???"},"\n","^\"T-This is a library! Keep it down a bit...”  ",{"#":"speaker _"},"\n","^They seem embarrassed by their own conduct rather than genuinely disapproving of yours. ",{"#":"sprite flustered"},"\n","^A faint blush grows on their face after they finally turn to face you, locking eyes. ",{"#":"speaker You"},{"#":"background library_blur"},"\n",["ev",{"^->":"0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-0","flg":2},{"s":["^“I’m sorry, I didn’t mean to startle you. What are you reading?” ",{"->":"$r","var":true},null]}],["ev",{"^->":"0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-1","flg":2},{"s":["^“There is no one else here anyways... You’re the only one here reading a book.” ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"0.23.s"},[{"#n":"$r2"}],{"#":"like"},{"#":"speaker _"},{"#":"sprite neutral"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["ev",{"^->":"0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"0.24.s"},[{"#n":"$r2"}],{"#":"dislike"},{"#":"speaker _"},{"#":"sprite neutral"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^The pale green colored bookworm visibly defuses from the sudden shock of company. They adjust the narrow, large-rimmed glasses framing their delicate yet sculpted face. A shy, soft pout adorns their otherwise stern appearance. ",{"#":"speaker ???"},"\n","^“I suppose that is understandable. P-Pardon my reaction. Y-You just... nevermind. I was too into this book of floral communication. I-It is rather interesting.” ",{"#":"speaker _"},"\n","ev","str","^“No worries. What is your name, by the way? That book looks interesting.”","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^_“I have no idea what that means. But I’m interested in who you are?”","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["\n",{"->":"0.g-1"},{"#f":5}],"c-3":["\n","^“I have no idea what that means. But I’m interested in who you are?”","\n","^<i>You are about to enter a mini-game. If you do well, you can score some extra points with this character! Control your bee with WASD. ",{"#":"minigame"},"\n",{"->":"0.g-1"},{"#f":5}],"#f":5}],"g-1":["^You reach out to shake the hand of the mysteriously fidgety flowerkin, but they subtly react by inching backwards. ",{"#":"speaker Fey"},{"#":"sprite flustered"},"\n","^“I-It’s Fey.” ",{"#":"sprite neutral"},{"#":"speaker _"},"\n","^Fey crosses their arms straddling the large book to their chest. They subtly look down on the book but play it off quickly. ",{"#":"speaker Fey"},"\n","^“It’s whatever, this is just something I grabbed just now.”","\n","ev","str","^“I’d love to get to know you and the stuff you’re interested in. But I need to be home before sunset and I’m quite lost.”","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^“I need to get home as soon as possible, could you point me in the right direction?”","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["\n",{"->":"0.g-2"},{"#f":5}],"c-5":["\n",{"->":"0.g-2"},{"#f":5}],"#f":5}],"g-2":["^“Right...” ",{"#":"speaker _"},"\n","^Fey almost seems disappointed in your sudden change of subject, but doesn’t let it affect their demeanor. ",{"#":"speaker Fey"},"\n","^“You’re supposed to take the road just down here. There’s supposed to be a sign that lets you know where you’re going.” ",{"#":"speaker _"},"\n","^Fey adjusts the books on the nearest bookshelf and puts the large book back where it belonged. ",{"#":"speaker Fey"},{"#":"sprite flustered"},"\n","^“But, you know. Whatever.” ",{"#":"speaker _"},"\n","^They’re blushing again. ",{"#":"speaker Fey"},"\n","ev","str","^Kindly thank Fey and let them know you’ll visit again.","/str","/ev",{"*":".^.c-6","flg":4},"ev","str","^Wave them goodbye and quickly jog down the road they pointed towards.","/str","/ev",{"*":".^.c-7","flg":4},{"c-6":["\n",{"->":"0.g-3"},{"#f":5}],"c-7":["\n",{"->":"0.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"...Bye\"","\n",["done",{"#f":5,"#n":"g-4"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}