{"inkVersion":20,"root":[["^As you arrive at the flowery and vibrant park with cozy benches scattered around the small pond, the sound of a bouncing ball catches your attention.","\n","^The sun is shining brightly overhead, casting a warm glow on the lush greenery and blooming flowers.","\n","^Near the heart of the park, a makeshift basketball hoop has been set up and a cheerful tune plays from the portable speaker on the grass.","\n","^As you walk closer towards the sounds, you notice a flowerkin with contagious smile energetically tossing basketball in the hoop - effortlessly combining athleticism with a sunny and relaxing attitude.","\n","^After a couple of successful shots the sunny flowerkin, reminiscent of a sunflower, turns towards you and walks forward with easy, confident strides while giving you a dashing smile. ",{"#":"speaker ???"},{"#":"sprite neutral"},{"#":"background park_blur"},"\n","^\"What’s up, sunshine? Ready to join the fun?\" ",{"#":"speaker Sol"},"\n","ev","str","^\"Absolutely, I’m up for a game. What are we playing?\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"I was actually just admiring you(r skills), do you mind if I join you?\"","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^\"Yoo, nice to meet you! I’m Solaris, but my friends call me Sol.\"","\n","^\"You really up for a game or just soaking up the good sunny vibes?\" ",{"#":"speaker _"},"\n","^Your surroundings seem to come more alive as Solaris awaits your response, the vibrant park perfectly emphasizing the happy attitude of the flowerkin before you. Their relaxing charisma and easy-going nature create a safe space to be yourself. ",{"#":"speaker You"},"\n",["ev",{"^->":"0.g-0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Game on! Is basketball your favorite sport?\" ",{"->":"$r","var":true},null]}],["ev",{"^->":"0.g-0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^\"Just soaking up the vibes, but I’m open to try something new. What would you recommend?\" ",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],{"#":"speaker"},"\n",{"->":"0.g-1"},{"#f":5}],"c-3":["ev",{"^->":"0.g-0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],{"#":"like"},"\n",{"->":"0.g-1"},{"#f":5}],"#f":5}],"g-1":["^The bright sunflowerkin seems excited with your answer and unconsciously bounces up and down on their heels. The positivity radiates from Sol’s presence alone. ",{"#":"speaker Sol"},{"#":"sprite happy"},"\n","^\"You know, I’m all about that basketball life - it’s a great way to exercise but also to meet new people! \"","\n","^\"By the way, what brings you here today?\"","\n","ev","str","^_I was on my way back from work and got lost, but luckily I managed to find this beautiful place (and you)","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^I was in my thoughts and buzzed past one intersection. Would you be able to help me?","/str","/ev",{"*":".^.c-5","flg":4},{"c-4":["\n","^\"You got that right! We’re all about good vibes and positive energy here. Stick around and let’s make today awesome!\" ",{"#":"speaker _"},{"#":"like"},"\n","^<i>You are about to enter a mini-game. If you do well, you can score some extra points with this character! Control your bee with WASD. ",{"#":"minigame"},"\n",{"->":"0.g-2"},{"#f":5}],"c-5":["\n","^\"Absolutely! Sometimes fate takes us to mysterious places, but I know this forest like the backs of my leaves! I’ll guide you in the right direction.\" ",{"#":"speaker _"},"\n",{"->":"0.g-2"},{"#f":5}],"#f":5}],"g-2":["^After a short but happy conversation with the bright and easygoing flowerkin, who makes the magical forest even more enchanting, you decide to move on with your journey.","\n",["done",{"#f":5,"#n":"g-3"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}